In [2]:
import pandas as pd
import os

In [5]:
files = [file for file in os.listdir('/home/vijay/Documents/Project Work/Pandas-Data-Science-Tasks-master/Sales_Data')]

In [3]:
sales_data = pd.DataFrame()

In [4]:
for file in files:
    df = pd.read_csv("/home/vijay/Documents/Project Work/Pandas-Data-Science-Tasks-master/Sales_Data/"+file)
    sales_data = pd.concat([sales_data,df])
sales_data.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,248151,AA Batteries (4-pack),4,3.84,09/17/19 14:44,"380 North St, Los Angeles, CA 90001"
1,248152,USB-C Charging Cable,2,11.95,09/29/19 10:19,"511 8th St, Austin, TX 73301"
2,248153,USB-C Charging Cable,1,11.95,09/16/19 17:48,"151 Johnson St, Los Angeles, CA 90001"
3,248154,27in FHD Monitor,1,149.99,09/27/19 07:52,"355 Hickory St, Seattle, WA 98101"
4,248155,USB-C Charging Cable,1,11.95,09/01/19 19:03,"125 5th St, Atlanta, GA 30301"

# Checking the Data Types

In [5]:
sd = sales_data
sd.dtypes

Order ID            object
Product             object
Quantity Ordered    object
Price Each          object
Order Date          object
Purchase Address    object
dtype: object

# Row Count

In [6]:
sd.shape[0]

186850

# Checking the null rows

In [7]:
nan_df = sd[sd.isna().any(axis = 1)]
nan_df

      Order ID Product Quantity Ordered Price Each Order Date Purchase Address
198        NaN     NaN              NaN        NaN        NaN              NaN
574        NaN     NaN              NaN        NaN        NaN              NaN
776        NaN     NaN              NaN        NaN        NaN              NaN
1383       NaN     NaN              NaN        NaN        NaN              NaN
1436       NaN     NaN              NaN        NaN        NaN              NaN
...        ...     ...              ...        ...        ...              ...
12942      NaN     NaN              NaN        NaN        NaN              NaN
13531      NaN     NaN              NaN        NaN        NaN              NaN
13616      NaN     NaN              NaN        NaN        NaN              NaN
13903      NaN     NaN              NaN        NaN        NaN              NaN
14387      NaN     NaN              NaN        NaN        NaN              NaN

[545 rows x 6 columns]

# Dropping the null columns

In [8]:
sd = sd.dropna(how = 'any')

# Fetching the Duplicate rows

In [9]:
duplicate_rows = sd[sd.duplicated(keep = False)]

# Dropping the duplicate rows

In [10]:
sd = sd.drop_duplicates()

In [11]:
usd =  pd.read_csv('/home/vijay/Documents/Project Work/Data_Sets/Sales_Data')
usd.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,248151,AA Batteries (4-pack),4,3.84,09/17/19 14:44,"380 North St, Los Angeles, CA 90001"
1,248152,USB-C Charging Cable,2,11.95,09/29/19 10:19,"511 8th St, Austin, TX 73301"
2,248153,USB-C Charging Cable,1,11.95,09/16/19 17:48,"151 Johnson St, Los Angeles, CA 90001"
3,248154,27in FHD Monitor,1,149.99,09/27/19 07:52,"355 Hickory St, Seattle, WA 98101"
4,248155,USB-C Charging Cable,1,11.95,09/01/19 19:03,"125 5th St, Atlanta, GA 30301"

# Converting the datatypes

In [12]:
usd = usd.astype({'Order ID':'object','Quantity Ordered':'int64','Price Each':'float64'})

In [13]:
usd['Order Date'] = pd.to_datetime(usd['Order Date'])

/tmp/ipykernel_19768/2020318083.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  usd['Order Date'] = pd.to_datetime(usd['Order Date'])

In [14]:
usd.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,248151,AA Batteries (4-pack),4,3.84,2019-09-17 14:44:00,"380 North St, Los Angeles, CA 90001"
1,248152,USB-C Charging Cable,2,11.95,2019-09-29 10:19:00,"511 8th St, Austin, TX 73301"
2,248153,USB-C Charging Cable,1,11.95,2019-09-16 17:48:00,"151 Johnson St, Los Angeles, CA 90001"
3,248154,27in FHD Monitor,1,149.99,2019-09-27 07:52:00,"355 Hickory St, Seattle, WA 98101"
4,248155,USB-C Charging Cable,1,11.95,2019-09-01 19:03:00,"125 5th St, Atlanta, GA 30301"

In [15]:
usd = usd.sort_values(by = 'Order Date')

In [16]:
usd['Total Amount'] = usd['Quantity Ordered'] * usd['Price Each']
usd['City'] = usd['Purchase Address'].str.split(',').str[1] 
usd['Purchased Month'] = usd['Order Date'].dt.strftime('%B')
usd['Purchased Hour'] =  usd['Order Date'].dt.hour

In [17]:
usd.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Total Amount,City,Purchased Month,Purchased Hour
112858,147268,Wired Headphones,1,11.99,2019-01-01 03:07:00,"9 Lake St, New York City, NY 10001",11.99,New York City,January,3
113664,148041,USB-C Charging Cable,1,11.95,2019-01-01 03:40:00,"760 Church St, San Francisco, CA 94016",11.95,San Francisco,January,3
115008,149343,Apple Airpods Headphones,1,150.00,2019-01-01 04:56:00,"735 5th St, New York City, NY 10001",150.00,New York City,January,4
115657,149964,AAA Batteries (4-pack),1,2.99,2019-01-01 05:53:00,"75 Jackson St, Dallas, TX 75001",2.99,Dallas,January,5
115015,149350,USB-C Charging Cable,2,11.95,2019-01-01 06:03:00,"943 2nd St, Atlanta, GA 30301",23.90,Atlanta,January,6

In [18]:
dropped = usd.drop(columns='Purchase Address')

In [19]:
dropped.to_excel('/home/vijay/Downloads/SALES_DATA.xlsx',index = False)